app/controllers/answers_controller.rb

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", 17]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "answers" ("question_id", "email", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["question_id", 4], ["email", "hi@google.com"], ["body", "Oh, I totally asked myself! I'm great! >:D"], ["created_at", "2016-01-18 10:57:41.838182"], ["updated_at", "2016-01-18 10:57:41.838182"]]
---
    def create

        question = Question.find(params[:answer][:question_id])
        question.answers.create(answer_params)