app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 3]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  ORDER BY "answers"."created_at" DESC  [["question_id", 4]]
---
    def show
        @question = Question.find(params[:id])
        @answers = @question.answers.order(created_at: :desc)

INSERT INTO "questions" ("email", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "hi@google.com"], ["body", "Hello! How are you?"], ["created_at", "2016-01-18 10:52:17.799460"], ["updated_at", "2016-01-18 10:52:17.799460"]]
---
    def create
        Question.create(question_params)